Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/legal_aid_and_advice/civil_legal_advice_and_legal_aid.html.txt.tmx
Source language: en
Languages: ga

source: Civil Legal Advice and Legal Aid
ga: Comhairle agus Cúnamh Dlí

source: The Legal Aid Board is responsible for the provision of civil legal aid and advice to those unable to pay for such services from their own resources
ga: Tá an Bord Cúnamh Dlí freagrach as comhairle agus cúnamh dlí a sholáthar dóibh siúd nach bhfuil in ann íoc as na seirbhísí sin óna n-acmhainní féin

source: Legal aid means representation by a barrister or solicitor in civil proceedings in court, in addition to the preparatory work this entails
ga: Ciallaíonn cúnamh dlí ionadaíocht ag abhcóide nó aturnae in imeachtaí sibhialta i gcúirt, sa mhullach ar an obair ullmhúcháin a bhíonn i gceist leis seo

source: Legal advice includes any oral or written advice provided by a solicitor or barrister
ga: Áirítear le comhairle dlí aon chomhairle ó bhéil nó scríofa a chuireann aturnae nó abhcóide ar fáil

source: As part of Abhaile, the national Mortgage Arrears Resolution Service, a new aid and advice scheme for people in serious mortgage arrears covers a certain amount of free legal aid and advice for eligible borrowers
ga: Faoi Abhaile, an tSeirbhís um Réiteach Riaraistí Morgáiste, cuireann scéim nua do dhaoine i ndroch-riaráistí morgáiste méid áirithe chomhairle agus cúnamh dlí ar fail d'iasachtaithe cáilithe

source: Read more about this scheme
ga: Léigh tuilleadh faoin scéim seo

source: Civil legal advice is any oral or written advice given to you by a solicitor or a barrister about how the law applies in civil matters
ga: Is comhairle shibhialta dlí aon chomhairle ó bhéil nó scríofa a thugann aturnae nó abhcóide duit faoi conas a chuirtear an dlí i bhfeidhm in ábhair shibhialta

source: It can also include writing letters on your behalf or acting for you in negotiations with other people
ga: D’fhéadfaí a áireamh leis litreacha a scríobh ar do shon nó gníomhú duit in idirbheartaíochtaí le daoine

source: Legal advice is provided by the Board's solicitors in their law centre network
ga: Cuireann aturnaetha an Bhoird comhairle dlí ar fáil ina líonra ionad dlí

source: Legal advice may be given in relation to any legal matter with the exception of the following:
ga: Is féidir comhairle dlí a thabhairt maidir le haon ábhar dlí seachas an méid a leanas:

source: • A criminal law matter, unless the person seeking advice is a complainant in a sexual assault or rape case
ga: • Ábhar dlí choiriúil, mura gearánaí an duine a lorgaíonn an chomhairle i gcás ionsaí gnéasaigh nó éignithe

source: • A matter that in the opinion of the Board could be dealt with by obtaining appropriate advice other than state-assisted legal advice
ga: • Ábhar, ina bhfuil an Bord faoin tuairim go bhféadfaí déileáil leis tríd an gcomhairle chuí a fháil seachas comhairle dlí ó chúnamh an stáit

source: The Board may decide to stop providing advice where it considers it is no longer reasonable to do so or that the person receiving the advice is no longer eligible because of his/her means to receive it
ga: D’fhéadfadh an Bord a chinneadh chun stop a chur le comhairle dlí sa chás go measann siad nach bhfuil sé réasúnach a thuilleadh amhlaidh a dhéanamh nó nach bhfuil an duine a fhaigheann an chomhairle i dteideal a thuilleadh mar thoradh ar a mhaoin/maoin chun í a fháil

source: In order to qualify for legal advice you must pass a means test
ga: D’fhonn cáiliú do chomhairle dlí, ní mór duit pas a fháil i dtástáil mhaoine

source: If your application is successful you will be asked to make a financial contribution
ga: Má bhíonn an rath ar d’iarratas, iarrfar ort ranníocaíocht airgeadais a dhéanamh

source: How much you pay will depend on your means
ga: Braithfidh an méid a íocfaidh tú ar do mhaoin

source: If you are a complainant in a sexual assualt or rape case, you do not have to pass a means test or pay a contribution
ga: Más gearánaí thú i gcás ionsaí ghnéasaigh nó éignithe, ní gá go n-éireoidh leat i dtástáil mhaoine nó ranníocaíocht a íoc

source: If the Board refuses to grant you legal advice, you may appeal the decision
ga: Má dhiúltaíonn an Bord chun comhairle dlí a cheadú duit, is féidir leat an cinneadh a achomharc

source: Legal aid means representation by a solicitor or barrister in civil proceedings in the District, Circuit, High and Supreme Courts
ga: Ciallaíonn cúnamh dlí ionadaíocht ag aturnae nó abhcóide in imeachtaí dlí sna Cúirteanna Dúiche, Cuarda, Ard-Chúirteanna agus sna Cúirteanna Uachtaracha

source: This means that you have engaged the Board to act on your behalf in the proceedings, including sending correspondence on your behalf, drafting court documents, giving advice, representation in court and all the background preparatory work required
ga: Ciallaíonn seo go ndeachaigh tú i dteagmháil leis an mBord chun gníomhú ar do shon sna himeachtaí, lena n-áirítear comhfhreagras a sheoladh ar do shon, cáipéisí cúirte a dhréachtú, comhairle a thabhairt, ionadaíocht a dhéanamh duit sa chúirt agus an obair uile chúlra ullmhúcháin a theastaíonn a dhéanamh

source: Generally, legal aid is provided by solicitors employed by the Board in its law centres
ga: Go ginearálta, cuireann aturnaetha atá fostaithe ag an mBord cúnamh dlí ar fáil ina n-ionaid dlí

source: In certain family law matters, legal aid may be provided by a solicitor in private practice from a panel of solicitors which has been established by the Board
ga: In ábhair áirithe dlí teaghlaigh, is féidir le haturnae cúnamh dlí a chur ar fáil i gcleachtas príobháideach ó phainéil aturnaetha a bhunaigh an Bord

source: Legal aid is available in relation to most civil matters
ga: Bíonn cúnamh dlí ar fáil do nach mór gach ábhar sibhialta

source: However, certain cases are excluded from the scope of civil legal aid
ga: Ní áirítear cásanna áirithe, áfach, ó scóip an chúnaimh shibhialta dlí

source: In order to qualify for legal aid you must pass both a means test and a merit test
ga: D’fhonn cáiliú do chúnamh dlí, ní mór duit pas a fháil i dtástáil mhaoine agus i dtástáil tuilleamh

source: If you qualify for legal aid, you will have to make some contributions to the overall costs of the proceedings except for child-care cases
ga: Má cháilítear thú do chúnamh dlí, beidh ort roinnt ranníocaíochtaí a dhéanamh do chostais fhoriomlána na n-imeachtaí, ach amháin i gcás cásanna cúraim leanaí

source: The Rates section below sets out the minimum and maximum contributions that may be made
ga: Leagtar amach i mír na Rátaí thíos na ranníocaíochtaí uasta agus íosta is féidir a dhéanamh

source: If the Board refuses to grant you legal aid, you may appeal the decision
ga: Má dhiúltaíonn an Bord chun cúnamh dlí a cheadú duit, is féidir leat an cinneadh a achomharc

source: This is an initial test to ensure that your case is a legitimate one and that a reasonable person would take the case and would be advised to take the case
ga: Seo tástáil tosaigh lena chinntiu gur cás dlisteanach do chás agus go nglacfadh duine réasúnta an cás agus go molfaí dóibh an cás a ghlacadh

source: You will pass the merit test, if in the Board's opinion:
ga: Éireoidh leat sa tástáil tuilleamh, más é tuairim an Bhoird:

source: You have as a matter of law reasonable grounds for instituting, defending or being a party to the proceedings for which legal aid is sought
ga: Go bhfuil agat, i dtaobh ábhar dlí de, údar réasúnta leis na himeachtaí a thosú, a chosaint nó bheith i do pháirtí leis na himeahctaí a lorgaítear an cúnamh dlí dóibh

source: You are reasonably likely to be successful in the proceedings
ga: Gur dóigh go réasúnta go n-éireoidh leat sna himeachtaí

source: The proceedings for which legal aid is sought are the most satisfactory means of achieving the result sought by you
ga: Gurb iad na himeachtaí a lorgaítear an cúnamh dlí dóibh an bealach is sásúla chun an toradh a lorgaíonn tú a bhaint amach

source: Having regard to all the circumstances (including the probable cost to the Board, measured against the likely benefit to you), it is reasonable to grant the application
ga: Agus aird ar an uile chúinse (lena n-áirítear an costas dóchúil don Bhord, a mheastar i leith na tairbhe dóchúla duit), gur réasúnta an t-iarratas a cheadú

source: Your case does not fall within the excluded areas
ga: Ní thagann do chás faoi chuimsiú na limistéar eisiata

source: If the proceedings concern the welfare of a child including custody or access, factors 2 and 4 do not apply
ga: Má bhaineann leas linbh leis na himeachtaí, lena n-áirítear caomhnóireacht nó rochtain, ní bhaineann tosca 2 agus 4

source: In order to qualify for either legal advice or legal aid, you must complete a means test form, which is available at all Legal Aid offices
ga: D’fhonn cáiliú do chomhairle nó do chúnamh dlí, ní mór duit foirm um thástáil mhaoine a chomhlánú, ar a bhfuil fáil san uile oifig Cúnamh Dlí

source: The law setting out the means test regulations are SI 273/1996 Civil Legal Aid Regulations 1996, SI 8/2002 Civil Legal Aid Regulations 2002, SI 460/2006 Civil Legal Aid Regulations 2006 and SI 346/2013 Civil Legal Aid Regulations 2013
ga: Is é an dlí a leagann amach na rialacháin um thástáil mhaoine IR 273/1996 Rialacháin um Chúnamh Dlí Shibhialta, 1996, IR 8/2002 Rialacháin um Chúnamh Dlí Shibhialta, 2002, IR 460/2006 Rialacháin um Chúnamh Dlí Shibhialta, 2006 agus IR 346/2013 Rialacháin um Chúnamh Dlí Shibhialta 2013

source: The Legal Aid Board means test is different to the social welfare or Health Service Executive (HSE) means tests
ga: Is éagsúil an Bord Cúnamh Dlí ó thástálacha maoine leasa shóisialaigh nó Fheidhmeannacht na Seirbhíse Sláinte (FSS)

source: The time period of relevance is the year following your application
ga: Is í an tréimhse ábhartha ama an bhliain i ndiaidh d’iarratais

source: The Board will seek to estimate what your disposable income for that year will be
ga: Féachfaidh an Bord lena mheas céard é d’ioncam indiúscartha don bhliain sin

source: It may be necessary to consider your income for the last year in order to do so
ga: B’fhéidir go mbeidh sé riachtanach breithniú a dhéanamh ar d’ioncam don bhliain seo caite d’fhonn é seo a dhéanamh

source: As well as having disposable income of less than €18,000, you must also have disposable capital of less than €100,000
ga: Chomh maith le hioncam indiúscartha níos lú ná €18,000, ní mór go mbíonn agat caipiteal níos lú ná €100,000

source: Your family home is not considered when assessing disposable capital
ga: Ní dheántar breithniú ar theach do theaghlaigh nuair a bhíonn caipiteal indiúscartha á mheasúnú

source: Disposable income is total income less deductible expenses including income tax, mortgage repayments, rent, social insurance contributions, interest on loans, child-minding expenses and other items
ga: Is ionann ioncam indiúscartha agus an t-ioncam iomlán lúide costais asbhainteacha, lena n-áirítear cáin ioncaim, aisíocaíochtaí morgáiste, cíos, ranníocaíochtaí árachas sóisialta, ús ar iasachtaí, costais feighlíocht leanaí agus míreanna eile

source: The Legal Aid Board is authorised (by your application form for legal aid) to get information from the Department of Social Protection and the Revenue Commissioners about your income or capital
ga: Tá an Bord Cúnamh Dlí údaraithe (ag d’fhoirm iarratais ar chúnamh dlí) chun faisnéis a fháil ón Roinn Coimirce Sóisialaí agus ó na Coimisinéirí Ioncaim faoi d’ioncam nó do chaipiteal

source: All sources or income are considered by the Legal Aid Board and taken into account including income from a job, self-employment, pensions (both occupational and social welfare) investments, rental income, etc
ga: Déanann an Bord Cúnamh Dlí breithniú ar an uile fhoinse ioncaim agus í a chur san áireamh, lena n-áirítear ioncam ó phost, féinfhostaíocht, pinsin (pinsin ghairme agus leasa shóisialaigh araon), infheistíochtaí, ioncam ó chíosa, etc

source: The value of benefits, privileges and perks that you enjoy will be taken into account
ga: Cuirfear san áireamh luach na sochar, na bpribhléidí agus na bpeorcaisí a théann chun do shochair

source: This includes free accommodation and/or board, and the value of a non-contributory pension scheme
ga: Áirítear leis seo cóiríocht agus/nó béilí shaor in aisce, agus luach scéim neamhranníocach pinsin

source: In the case of a married couple, the income of both is taken into account except
ga: I gcás lanúin phósta, cuirtear ioncam an dá ruda san áireamh seachas:

source: • where they are on opposing sides in the proposed action or
ga: • sa chás go bhfuil siad ar a mhalairt de thaobh sa chaingean a bheartaítear, nó

source: • they are separated and living apart
ga: • go bhfuil siad ina gcónaí amach óna chéile

source: Once the Board has estimated your annual income, it will then seek to calculate your disposable income by deducting the following allowances and expenditure
ga: A luaithe a dhéanann an Bord d’ioncam bliantúil a mheas, féachfaidh siad ansin le d’ioncam indiúscartha a ríomh trí na liúntais agus an caiteachas a leanas a bhaint de:

source: • Spouse/partner - there is a deduction of €3,500 if you have a spouse/partner
ga: • Céile/páirtnéir – is ann d’asbhaint €3,500 má tá céile/páirtnéir agat

source: (The spouse/partner has to be a dependant)
ga: (Ní mór don chéile/pháirtnéir bheith ina c(h)leithiúnaí)

source: • Dependants - there is a deduction of €1,600 for each dependant
ga: • Cleithiúnaithe – is ann d’asbhaint €1,600 do gach cleithiúnaí

source: A dependant may be a child or step-child under 18 or over 18 and in full-time education or a dependant relative or other person who lives with you and is supported by you
ga: D’fhéadfadh leanbh faoi 18 mbliana nó níos sine ná 18 atá in oideachas lánáimseartha nó gaol cleithiúnaigh nó duine eile a chónaíonn leat agus a dtugann tú tacaíocht dóibh bheith ina c(h)leithiúnaí

source: • Child care expenses up to a maximum of €6,000 per child
ga: • Costais chúram linbh a mhéid agus €6,000 an leanbh

source: • Accommodation costs up to a maximum of €8,000 per year
ga: • Costais chóiríochta a mhéid agus €8,000 sa bhliain

source: • PRSI contributions are deducted in full
ga: • Baintear ranníocaíochtaí ÁSPC ina n-iomláine

source: • Income tax payments are deducted in full
ga: • Baintear íocaíochtaí cáin ioncaim ina n-iomláine

source: • Ex gratia payments received up to €1,040 in total
ga: • Íocaíochtaí ex gratia a fuarthas a mhéid agus €1,400 ar an iomlán

source: All persons under 18 years and those over that age in full-time education are regarded as dependants of their parents, step-parents or guardians
ga: Gach duine faoi 18 mbliana agus iad siúd níos sine ná an aois sin atá in oideachas lánaimseartha agus a mheastar gur cleithiúnaithe iad dá dtuismitheoirí nó dá gcaomhnóirí

source: In those circumstances, the parents', step-parents' or guardians' income is taken into account if the young person is looking for legal services
ga: Faoi na cúinsí sin, cuirtear ioncam na dtuismitheoirí nó na gcaomhnóirí san áireamh má bhíonn an duine óg ag lorg seirbhísí dlí

source: There are minimum contributions that must be paid except in cases of extreme hardship
ga: Seo iad na ranníocaíochtaí íosta nach mór a íoc seachas i gcásanna fíor-chruatain

source: However, the contribution that you must make depends on your disposable income for legal advice and your disposable income and disposable capital for legal aid
ga: Braitheann an ranníocaíocht nach mór duit a dhéanamh, áfach, ar d’ioncam indiúscartha do chomhairle dlí agus ar d’ioncam agus do chaipiteal indiúscartha do chúnamh dlí

source: There is no contribution required in child-care cases, however, you still need to come within the disposable income and capital thresholds
ga: Níl aon ranníocaíocht ag teastáil i gcásanna cúraim leanaí, áfach, caithfidh tú fós a thagann faoina tairseacha ioncam indiúscartha agus caipitil

source: Legal advice: a minimum contribution of €30 must be paid where your disposable income is less than €11,500
ga: Comhairle dlí: ní mór ranníocaíocht €30 ar a laghad a íoc sa chás go bhfuil d’ioncam níos lú ná €11,500

source: If it is more, your contribution is one-tenth of the difference between €11,500 and your disposable income, up to a maximum of €150
ga: Más níos mó ná seo atá sé, is ionann do ranníocaíocht agus an deichiú cuid den difríocht idir €11,500 agus d’ioncam indiúscartha, a mhéid agus €150

source: Legal aid: a minimum contribution of €130 must be paid where your disposable income is less than €11,500
ga: Cúnamh dlí: ní mór ranníocaíocht €130 ar a laghad a íoc sa chás go bhfuil d’ioncam níos lú ná €11,500

source: If it is more, your contribution is €130 plus one-quarter of the difference between €11,500 and your disposable income
ga: Más níos mó ná seo atá sé, is ionann do ranníocaíocht €130 agus móide an ceathrú cuid den difríocht idir €11,500 agus d’ioncam indiúscartha

source: You must pay an additional contribution if your disposable capital is more than €4,000 as follows:
ga: Ní mór duit ranníocaíocht bhreise a íoc más níos mó ná €4,000 do chaipiteal indiúscartha, amhail a leanas:

source: • Up to €54,000 your contribution is 2.5% of the difference between €4,000 and your disposable capital
ga: • Is ionann do ranníocaíocht agus 2.5% den difríocht idir €4,000 agus do chaipiteal indiúscartha chuig a mhéid agus €54,000

source: • Over €54,000 your contribution is €1,250 plus 5% of the difference between €54,000 and your disposable capital
ga: • Is ionann do ranníocaíocht agus €1,250 móide 5% den difríocht idir €54,000 agus do chaipiteal indiúscartha breis agus €54,000

source: If the legal matter in question is a marriage dispute and both spouses are eligible for legal aid, they should be represented by different law centres
ga: Más díospóid phósta an t-ábhar dlí atá faoi chaibidil agus go bhfuil an bheirt chéilí i dteideal cúnamh dlí a fháil, ba cheart d’ionaid dhifriúla dlí ionadaíocht a dhéanamh dóibh

source: To find out whether you qualify for legal aid and/or advice, you should simply complete the Legal Aid Application Form (pdf) available in the law centres
ga: Chun a dheimhniú an gcáilíonn tú do chúnamh dlí agus/nó comhairle dlí, ba cheart duit an Fhoirm Iarratais ar Chúnamh Dlí (pdf) a chomhlánú. Tá fáil uirthi sna hionaid dlí

source: You will give details about your income and your expenses on a confidential basis
ga: Tabharfaidh tú sonraí faoi d’ioncam agus do chuid costas ar bhonn rúnda

source: The Board provides information on how to complete the form (pdf)
ga: Soláthraíonn an Bord faisnéis maidir le conas an bhfoirm a chomhlánú (pdf)

source: If your application is accepted, you will be asked to make a minimum contribution
ga: Má ghlactar le d’iarratas, iarrfar ort ranníocaíocht íosta a dhéanamh

source: If legal aid is necessary, the Board will issue you with a legal aid certificate
ga: Má bhíonn gá le cúnamh dlí, eiseoidh an Bord teastas cúnamh dlí duit

source: There is a waiting time for an appointment with a solicitor
ga: Is ann do thréimhse feithimh le haghaidh coinne le haturnae

source: The maximum waiting time for an appointment with a solicitor is four months
ga: Ó 2005 i leith, is í an tréimhse uasta feithimh le haghaidh coinne le haturnae ceithre mhí

source: However, the Board gives priority to certain categories of cases, such as domestic violence, child care, child abduction and cases where there is a danger that the time limits for issuing proceedings may expire
ga: Déanann an Bord tosaíocht de chatagóirí áirithe de chásanna, áfach, ar nós foréigean teaghlaigh, cúram leanaí, abduchtú leanaí agus cásanna ina bhfuil an baol go bhféadfadh na teorainneacha ama chun imeachtaí a eisiúint éag

source: If your application for legal aid or legal advice is refused, you may appeal the decision
ga: Má dhiúltaítear d’iarratas ar chúnamh dlí nó ar chomhairle dlí, is féidir leat an cinneadh a achomharc

source: The appeal is a two-step process;
ga: Próiseas dhá chéime is ea an t-achomharc;

source: The decision maker will review his/her decision
ga: Déanfaidh an té a dhéanfaidh an cinneadh athbhreithniú ar a c(h)inneadh

source: If you are still unsatisfied with his/her decision, you may appeal to the "appeal committee", which consists of the chairman and four members of the Board
ga: Má bhíonn tú fós míshásta lena c(h)inneadh, is féidir leat achomharc a dhéanamh leis an “gcoiste achomhairc”, ina bhfuil cathaoirleach agus ceathrar ball den Bhord

source: The decision of the appeal committee is final and unappealable
ga: Cinneadh deiridh a bheidh i gceist le cinneadh an choiste achomhairc agus ní féidir é a achomharc

source: Submit your written appeal through the law centre solicitor dealing with your application or send your written appeal directly to the Legal Aid Board
ga: Seol isteach d’achomharc i scríbhinn trí aturnae an ionaid dlí a dhéileálann le d’iarratas nó seol d’achomharc go díreach chuig an mBord Cúnamh Dlí

source: The Legal Aid and Advice Service operates out of law centres staffed by qualified solicitors
ga: Oibríonn an tSeirbhís Cúnamh agus Comhairle Dlí as ionaid dlí ina n-oibríonn aturnaetha cáilithe
